<?php
/*
5.使用循环计算出1+2+3+4+...100的累加和，输出该整数和
	循环条件： $i——1~100
	循环主体： $sum = $sum + $i ;   $i++;
*/
$i = 1;		#循环变量
$sum = 0;	#累加和
while( $i<=100 ){
	$sum = $sum + $i;
	$i++;
}
echo "1~100的累加和为：$sum";
echo '<hr>';
/*
6.使用循环计算出1*2*3*4*...10的累乘积，输出该乘积
	循环条件： $i——1~10
	循环主体： $chengJi = $chengJi*$i;  $i++;
*/
$i = 1;
$chengJi = 1;	#累乘积
while( $i<=10 ){
	$chengJi = $chengJi * $i;
	$i++;
}
echo "1~10的累乘积为：$chengJi";
echo '<hr>';
/*
7.使用循环计算出90/5 + 80/10 + 70/15 + 60/20 + 50/25的和，输出该和
*/
$sum = 0;	#总和
$zi = 90;	#分子  90~50
$mu = 5;	#分母  5~25
while( $mu<=25 ){
	$sum = $sum + ($zi/$mu);
	$zi -= 10;
	$mu += 5;
}
echo "总和：$sum";