<?php
/*
输出所有的四位水仙花数
$i = 1000~9999
获取$i的个位、十位、百位、千位
*/
for($i=1000;  $i<10000;  $i++){
	$ge = $i%10;		#1634%10 => 4
	$shi = $i/10%10;	#163.4%10 => 3
	$bai = $i/100%10;	#16.34%10 => 6
	$qian = $i/1000%10;	#1.634%10 => 1

	if($i === $ge*$ge*$ge*$ge + $shi*$shi*$shi*$shi + $bai*$bai*$bai*$bai + $qian*$qian*$qian*$qian){
		echo "$i ";
	}
}
echo '<hr>';

/*
输出100以内所有的质数
质数/素数：只能被1和自身整除的数
i是质数吗：i%2、i%3、...i%(i-1)
方法1：循环2~100：$i；  $count=0;表示能够整除i的数字的数量(2~i-1)
*/
for($i=2; $i<100;  $i++){  #i:要判定是否为质数的数
	$count=0;  #当前比i小且能整除i的数字的个数
	#计算比i小且能整除i的数字的个数
	for($j=2; $j<$i; $j++){
		if($i%$j===0){
			$count++;
			#break;
		}
	}
	#判断i是否为质数
	if($count===0){  #比i小且能整除i的数字个数为0
		echo "$i ";
	}
}
echo '<hr>';

for($i=2;  $i<100; $i++){
	for($j=2; $j<$i; $j++){	
		if($i%$j===0){
			break;
		}
	}
	#执行至此,$j的值有几种可能？
	#可能1：循环条件不再满足而退出,j>=i:    i是质数
	#可能2：循环过程中执行了break,j<i:    i不是质数
	if($j>=$i){
		echo "$i ";
	}
}