<?php
/*
11.输出：
  ※				第1行有1列	
  ※※				第2行有2列
  ※※※			第3行有3列
  ※※※※			第4行有4列
  ※※※※※		第5行有5列      =>第i行有i列
*/
$i = 1;
while($i<=5){
	###########
	$j = 1;
	#while($j<=10){
	while($j<=$i){
		echo '※';
		$j++;
	}
	echo '<br>';
	###########
	$i++;
}


echo '<hr>';
/*
12.输出：
  1*1=1					第i行有i列
  2*1=2  2*2=4
  3*1=3  3*2=6  3*3=9
  4*1=4  4*2=8  4*3=12   4*4=16
*/
$i = 1;
while( $i<=9 ){
	################
	$j=1;
	while($j<=$i){
		echo "$i*$j=".($i*$j)."&nbsp;&nbsp;";
		$j++;
	}
	echo '<br>';
	################
	$i++;
}